Cases/container/container_no_outside/0.org/airOutside/G
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    air
    {
        type            calculated;
        value           uniform 0;
    }
    airOutside_to_ground
    {
        type            calculated;
        value           uniform 0;
    }
    //airOutside_to_batterie0
    //{
    //    type            calculated;
    //    value           uniform 0;
    //}
    airOutside_to_carrier
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
